# OLDSetLoadDataReal

## Description
Using selector, sets load data with real value for the parametric object.
Available selectors : kDLDSelectorWeight = 5.

```pascal
PROCEDURE OLDSetLoadDataReal(
				handle    : HANDLE;
				selector  : INTEGER;
				value     : REAL;
				loadIndex : INTEGER);
```

```python
def vs.OLDSetLoadDataReal(handle, selector, value, loadIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|selector|INTEGER|   |
|value|REAL|   |
|loadIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis